nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw23/driver_examples/plu/combination/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXW236
package_id: MCXW236BIHNAR
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '10', peripheral: GPIO, signal: 'PIO0, 6', pin_signal: PIO0_6/FC2_RXD_SDA_MOSI/SCT_OUT5/UTICK_CAP1/PLU_IN1/SEC_PIO0_6/SPIFI_IO0/CTIMER1_MAT2/CTIMER_INP6/ANT_SWITCH_0,
    direction: OUTPUT, gpio_init_state: 'false', mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '38', peripheral: GPIO, signal: 'PIO0, 7', pin_signal: PIO0_7/FC2_TXD_SCL_MISO/SCT_OUT4/UTICK_CAP2/PLU_IN2/SEC_PIO0_7/SPIFI_IO1/CTIMER1_MAT3/CTIMER_INP7/ANT_SWITCH_1,
    direction: OUTPUT, gpio_init_state: 'false', mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '32', peripheral: GPIO, signal: 'PIO0, 16', pin_signal: PIO0_16/FC1_SCK/SCT_GPI3/PLU_OUT4/SEC_PIO0_16/ANT_SWITCH_1/CTIMER4_MAT0/CTIMER_INP16, direction: OUTPUT,
    gpio_init_state: 'false', mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '2', peripheral: FLEXCOMM0, signal: RXD_SDA_MOSI, pin_signal: PIO0_2/FC0_RXD_SDA_MOSI/SCT_OUT9/SEC_PIO0_2/CTIMER0_MAT2/CTIMER_INP2, mode: inactive,
    slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '3', peripheral: FLEXCOMM0, signal: TXD_SCL_MISO, pin_signal: PIO0_3/FC0_TXD_SCL_MISO/SCT_OUT8/FREQME_GPIO_3/SEC_PIO0_3/CTIMER0_MAT3/CTIMER_INP3, mode: inactive,
    slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '39', peripheral: PLU, signal: 'INPUT, 3', pin_signal: PIO0_8/FC2_RTS_SCL_SSEL1/SCT_GPI7/UTICK_CAP3/PLU_IN3/SEC_PIO0_8/SPIFI_IO2/CTIMER2_MAT0/CTIMER_INP8/ANT_SWITCH_2,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '12', peripheral: PLU, signal: 'INPUT, 4', pin_signal: PIO0_9/SCT_GPI6/CLKOUT/PLU_IN4/SEC_PIO0_9/SPIFI_IO3/CTIMER2_MAT1/CTIMER_INP9/ANT_SWITCH_3, mode: inactive,
    slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '11', peripheral: PLU, signal: 'INPUT, 5', pin_signal: PIO0_10/FC2_SCK/SCT_GPI5/PLU_IN5/SEC_PIO0_10/SPIFI_CLK/CTIMER2_MAT2/CTIMER_INP10, mode: inactive,
    slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '31', peripheral: GPIO, signal: 'PIO0, 0', pin_signal: PIO0_0/FC0_CTS_SDA_SSEL0/FC1_RTS_SCL_SSEL1/SEC_PIO0_0/CTIMER0_MAT0/CTIMER_INP0, direction: INPUT,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '1', peripheral: GPIO, signal: 'PIO0, 1', pin_signal: PIO0_1/FC0_RTS_SCL_SSEL1/FC2_SCK/PLU_CLKIN/SEC_PIO0_1/CTIMER0_MAT1/CTIMER_INP1, direction: INPUT,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '7', peripheral: GPIO, signal: 'PIO0, 19', pin_signal: PIO0_19/FC2_TXD_SCL_MISO/SCT_GPI0/PLU_OUT7/SEC_PIO0_19/CTIMER4_MAT3/CTIMER_INP19, direction: INPUT,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '6', peripheral: PLU, signal: 'OUT, 1', pin_signal: PIO0_13/FC1_RXD_SDA_MOSI/FC2_CTS_SDA_SSEL0/SCT_OUT2/UTICK_CAP2/PLU_OUT1/SEC_PIO0_13/CTIMER3_MAT1/CTIMER_INP13,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '5', peripheral: PLU, signal: 'OUT, 2', pin_signal: PIO0_14/FC1_TXD_SCL_MISO/FC2_RTS_SCL_SSEL1/SCT_OUT1/FREQME_GPIO_14/UTICK_CAP3/PLU_OUT2/SEC_PIO0_14/CTIMER3_MAT2/CTIMER_INP14,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t gpio0_pin31_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_0 (pin 31)  */
    GPIO_PinInit(GPIO, 0U, 0U, &gpio0_pin31_config);

    gpio_pin_config_t gpio0_pin1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_1 (pin 1)  */
    GPIO_PinInit(GPIO, 0U, 1U, &gpio0_pin1_config);

    gpio_pin_config_t gpio0_pin10_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin 10)  */
    GPIO_PinInit(GPIO, 0U, 6U, &gpio0_pin10_config);

    gpio_pin_config_t gpio0_pin38_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_7 (pin 38)  */
    GPIO_PinInit(GPIO, 0U, 7U, &gpio0_pin38_config);

    gpio_pin_config_t gpio0_pin32_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin 32)  */
    GPIO_PinInit(GPIO, 0U, 16U, &gpio0_pin32_config);

    gpio_pin_config_t gpio0_pin7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin 7)  */
    GPIO_PinInit(GPIO, 0U, 19U, &gpio0_pin7_config);

    const uint32_t port0_pin0_config = (/* Pin is configured as PIO0_0 */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN0 (coords: 31) is configured as PIO0_0 */
    IOCON_PinMuxSet(IOCON, 0U, 0U, port0_pin0_config);

    const uint32_t port0_pin1_config = (/* Pin is configured as PIO0_1 */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN1 (coords: 1) is configured as PIO0_1 */
    IOCON_PinMuxSet(IOCON, 0U, 1U, port0_pin1_config);

    const uint32_t port0_pin10_config = (/* Pin is configured as PLU_IN5 */
                                         IOCON_PIO_FUNC6 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN10 (coords: 11) is configured as PLU_IN5 */
    IOCON_PinMuxSet(IOCON, 0U, 10U, port0_pin10_config);

    IOCON->PIO[0][13] =
        ((IOCON->PIO[0][13] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_OD_MASK)))

         /* Selects pin function.
          * : PORT013 (pin 6) is configured as PLU_OUT1. */
         | IOCON_PIO_FUNC(PIO0_13_FUNC_ALT6)

         /* Selects function mode (on-chip pull-up/pull-down resistor control).
          * : Inactive.
          * Inactive (no pull-down/pull-up resistor enabled). */
         | IOCON_PIO_MODE(PIO0_13_MODE_INACTIVE)

         /* Driver slew rate.
          * : Standard-mode, output slew rate is slower.
          * More outputs can be switched simultaneously. */
         | IOCON_PIO_SLEW(PIO0_13_SLEW_STANDARD)

         /* Input polarity.
          * : Disabled.
          * Input function is not inverted. */
         | IOCON_PIO_INVERT(PIO0_13_INVERT_DISABLED)

